flatPlate/system/points
(1.0000000000e-01 0.0000000000e+00 0.0000000000e+00)
(1.0000000000e-01 2.0000000000e-06 0.0000000000e+00)
(1.0000000000e-01 4.4430910161e-06 0.0000000000e+00)
(1.0000000000e-01 7.4274378726e-06 0.0000000000e+00)
(1.0000000000e-01 1.1072953370e-05 0.0000000000e+00)
(1.0000000000e-01 1.5526116449e-05 0.0000000000e+00)
(1.0000000000e-01 2.0965857806e-05 0.0000000000e+00)
(1.0000000000e-01 2.7610749426e-05 0.0000000000e+00)
(1.0000000000e-01 3.5727786935e-05 0.0000000000e+00)
(1.0000000000e-01 4.5643117643e-05 0.0000000000e+00)
(1.0000000000e-01 5.7755145330e-05 0.0000000000e+00)
(1.0000000000e-01 7.2550538344e-05 0.0000000000e+00)
(1.0000000000e-01 9.0623784221e-05 0.0000000000e+00)
(1.0000000000e-01 1.1270107654e-04 0.0000000000e+00)
(1.0000000000e-01 1.3966949380e-04 0.0000000000e+00)
(1.0000000000e-01 1.7261264276e-04 0.0000000000e+00)
(1.0000000000e-01 2.1285419839e-04 0.0000000000e+00)
(1.0000000000e-01 2.6201108992e-04 0.0000000000e+00)
(1.0000000000e-01 3.2205846995e-04 0.0000000000e+00)
(1.0000000000e-01 3.9540907730e-04 0.0000000000e+00)
(1.0000000000e-01 4.8501018221e-04 0.0000000000e+00)
(1.0000000000e-01 5.9446200944e-04 0.0000000000e+00)
(1.0000000000e-01 7.2816239734e-04 0.0000000000e+00)
(1.0000000000e-01 8.9148350560e-04 0.0000000000e+00)
(1.0000000000e-01 1.0909876718e-03 0.0000000000e+00)
(1.0000000000e-01 1.3346910898e-03 0.0000000000e+00)
(1.0000000000e-01 1.6323859054e-03 0.0000000000e+00)
(1.0000000000e-01 1.9960336701e-03 0.0000000000e+00)
(1.0000000000e-01 2.4402459636e-03 0.0000000000e+00)
(1.0000000000e-01 2.9828714954e-03 0.0000000000e+00)
(1.0000000000e-01 3.6457132763e-03 0.0000000000e+00)
(1.0000000000e-01 4.4554046763e-03 0.0000000000e+00)
(1.0000000000e-01 5.4444795688e-03 0.0000000000e+00)
(1.0000000000e-01 6.6526795610e-03 0.0000000000e+00)
(1.0000000000e-01 8.1285508342e-03 0.0000000000e+00)
(1.0000000000e-01 9.9313947585e-03 0.0000000000e+00)
(1.0000000000e-01 1.2133650656e-02 0.0000000000e+00)
(1.0000000000e-01 1.4823806455e-02 0.0000000000e+00)
(1.0000000000e-01 1.8109954187e-02 0.0000000000e+00)
(1.0000000000e-01 2.2124133188e-02 0.0000000000e+00)
(1.0000000000e-01 2.7027635516e-02 0.0000000000e+00)
(1.0000000000e-01 3.3017486757e-02 0.0000000000e+00)
(1.0000000000e-01 4.0334362636e-02 0.0000000000e+00)
(1.0000000000e-01 4.9272259498e-02 0.0000000000e+00)
(1.0000000000e-01 6.0190307261e-02 0.0000000000e+00)
(1.0000000000e-01 7.3527199462e-02 0.0000000000e+00)
(1.0000000000e-01 8.9818820223e-02 0.0000000000e+00)
(1.0000000000e-01 1.0971977638e-01 0.0000000000e+00)
(1.0000000000e-01 1.3402969998e-01 0.0000000000e+00)
(1.0000000000e-01 1.6372537796e-01 0.0000000000e+00)
(1.0000000000e-01 2.0000000000e-01 0.0000000000e+00)
